In [4]:
import pandas as pd
import numpy as np

data = {
    'emp_id': [1, 2, 3, 4, 5, 6],
    'name': ['Aman', 'Riya', 'Kunal', 'Neha', 'Amit', 'Pooja'],
    'dept': ['IT', 'HR', 'IT', 'HR', 'Finance', 'IT'],
    'salary': [60000, 50000, np.nan, 45000, 70000, np.nan],
    'experience': [3, 2, 4, 1, 6, 5]
}

df = pd.DataFrame(data)
df

   emp_id   name     dept   salary  experience
0       1   Aman       IT  60000.0           3
1       2   Riya       HR  50000.0           2
2       3  Kunal       IT      NaN           4
3       4   Neha       HR  45000.0           1
4       5   Amit  Finance  70000.0           6
5       6  Pooja       IT      NaN           5

In [6]:
df.isnull().sum()

emp_id        0
name          0
dept          0
salary        2
experience    0
dtype: int64

In [9]:
df["salary"].fillna(df["salary"].mean(),inplace=True)
df

   emp_id   name     dept   salary  experience
0       1   Aman       IT  60000.0           3
1       2   Riya       HR  50000.0           2
2       3  Kunal       IT  56250.0           4
3       4   Neha       HR  45000.0           1
4       5   Amit  Finance  70000.0           6
5       6  Pooja       IT  56250.0           5

In [19]:
df.groupby("dept")["salary"].mean()

dept
Finance    70000.0
HR         47500.0
IT         57500.0
Name: salary, dtype: float64

In [24]:
df.groupby("dept").agg({
    "salary":"mean",
    "experience":"max"})

          salary  experience
dept
Finance  70000.0           6
HR       47500.0           2
IT       57500.0           5

In [26]:
df.groupby("dept")["emp_id"].count()

dept
Finance    1
HR         2
IT         3
Name: emp_id, dtype: int64

In [30]:
df["salary_level"]=df["salary"].apply(
    lambda x:"high" if x>60000 else "low"
)

In [31]:
df

   emp_id   name     dept   salary  experience salary_level
0       1   Aman       IT  60000.0           3          low
1       2   Riya       HR  50000.0           2          low
2       3  Kunal       IT  56250.0           4          low
3       4   Neha       HR  45000.0           1          low
4       5   Amit  Finance  70000.0           6         high
5       6  Pooja       IT  56250.0           5          low

In [38]:
df["Bonus"]=df.apply(
    lambda row: row["salary"]*0.2 if row["experience"]>3 else row["salary"]*0.1, axis=1
)
df

   emp_id   name     dept   salary  experience salary_level    bonus    Bonus
0       1   Aman       IT  60000.0           3          low   6000.0   6000.0
1       2   Riya       HR  50000.0           2          low   5000.0   5000.0
2       3  Kunal       IT  56250.0           4          low   5625.0  11250.0
3       4   Neha       HR  45000.0           1          low   4500.0   4500.0
4       5   Amit  Finance  70000.0           6         high  14000.0  14000.0
5       6  Pooja       IT  56250.0           5          low   5625.0  11250.0